xtee6/op-monitor-daemon/src/test/resources/operationaldata.request

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope
        xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xroad="http://x-road.eu/xsd/xroad.xsd"
        xmlns:om="http://x-road.eu/xsd/op-monitoring.xsd"
        xmlns:id="http://x-road.eu/xsd/identifiers">
    <SOAP-ENV:Header>
        <xroad:client id:objectType="SUBSYSTEM">
           <id:xRoadInstance>XTEE-CI-XM</id:xRoadInstance>
           <id:memberClass>GOV</id:memberClass>
           <id:memberCode>00000001</id:memberCode>
           <id:subsystemCode>System1</id:subsystemCode>
        </xroad:client>
        <xroad:service id:objectType="SERVICE">  
           <id:xRoadInstance>XTEE-CI-XM</id:xRoadInstance>  
           <id:memberClass>GOV</id:memberClass>  
           <id:memberCode>00000001</id:memberCode>  
           <id:serviceCode>getSecurityServerOperationalData</id:serviceCode>  
        </xroad:service>
        <xroad:securityServer id:objectType="SERVER">
            <id:xRoadInstance>XTEE-CI-XM</id:xRoadInstance>
            <id:memberClass>GOV</id:memberClass>
            <id:memberCode>00000001</id:memberCode>
            <id:serverCode>00000001_1</id:serverCode>
        </xroad:securityServer>
        <xroad:id>DBOxxqv2csKysKHNwRCrU4QV0EWkqSUY</xroad:id>
        <xroad:protocolVersion>4.0</xroad:protocolVersion>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <om:getSecurityServerOperationalData>
            <om:searchCriteria>
                <om:recordsFrom>1477468193</om:recordsFrom>
                <om:recordsTo>1477468205</om:recordsTo>
            </om:searchCriteria>
        </om:getSecurityServerOperationalData>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
